<!DOCTYPE html>
<html lang="zh-cn">
<head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="referrer" content="always" />
    <title>博客园 - 开发者的网上家园</title>
        <meta name="keywords" content="开发者,博客园,开发者,程序猿,程序媛,极客,编程,代码,开源,IT网站,Developer,Programmer,Coder,Geek,技术社区" />
        <meta name="description" content="博客园是一个面向开发者的知识分享社区。自创建以来，博客园一直致力并专注于为开发者打造一个纯净的技术交流社区，推动并帮助开发者通过互联网分享知识，从而让更多开发者从中受益。博客园的使命是帮助开发者用代码改变世界。" />
    <link rel="shortcut icon" href="//common.cnblogs.com/favicon.ico" type="image/x-icon" />
    <link rel="Stylesheet" type="text/css" href="/css/aggsite.min.css?v=FRR6qbd_vc7TQxxV0n1kBxwFAKoajo20N8gkufL2xuk" />
        <link id="RSSLink" title="RSS" type="application/rss+xml" rel="alternate" href="http://feed.cnblogs.com/blog/sitehome/rss" />
    <script src="//common.cnblogs.com/script/jquery.js" type="text/javascript"></script>
    <script src="/js/aggsite.min.js?v=vWj2s6pYln0DCdPy6bGF421wYRTHyt5Wr_6ZKi9tmng"></script>
    <script async='async' src='https://www.googletagservices.com/tag/js/gpt.js'></script>
    <script>
        var googletag = googletag || {};
        googletag.cmd = googletag.cmd || [];
    </script>
    <script>
        googletag.cmd.push(function () {
            googletag.defineSlot('/1090369/A1', [468, 60], 'div-gpt-ad-1547816814884-0').addService(googletag.pubads());
            googletag.defineSlot('/1090369/B1', [300, 250], 'div-gpt-ad-1546331539224-0').addService(googletag.pubads());
            googletag.defineSlot('/1090369/B2', [300, 250], 'div-gpt-ad-1539007469525-0').addService(googletag.pubads());
            googletag.defineSlot('/1090369/B3', [300, 250], 'div-gpt-ad-1546331252242-0').addService(googletag.pubads());
            googletag.defineSlot('/1090369/B4', [300, 250], 'div-gpt-ad-1546331385104-0').addService(googletag.pubads());
            googletag.pubads().enableSingleRequest();
            googletag.enableServices();
        });

        /**/</script>
</head>
<body>
    <p><strong>1&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF08;&#x9A8C;&#x8BC1;&#xFF09;</strong></p>
<p><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215515679-1894360207.png" alt></p>
<p align="left">&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x770B;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x51E0;&#x4E2A;&#x5E94;&#x7528;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x82F9;&#x679C;&#x7684;FACE ID&#xFF0C;&#x81EA;&#x4ECE;&#x82F9;&#x679C;&#x63A8;&#x51FA;FaceID&#x540E;&#xFF0C;&#x4E1A;&#x754C;&#x5BF9;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x5E94;&#x7528;&#x597D;&#x50CF;&#x4FE1;&#x5FC3;&#x5927;&#x589E;&#xFF0C;&#x5404;&#x79CD;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x5E94;&#x7528;&#x4ECE;&#x6B64;&#x5F00;&#x59CB;&#x201C;&#x91CE;&#x86EE;&#x751F;&#x957F;&#x201D;&#x3002;</p>
<p align="left">&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;<strong>&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x5728;&#x5F88;&#x591A;&#x573A;&#x666F;&#x7684;&#x5E94;&#x7528;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x8BA4;&#x8BC1;&#x6548;&#x7387;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</strong>&#x524D;&#x4E24;&#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x673A;&#x573A;&#x5B89;&#x68C0;&#x90FD;&#x5F00;&#x59CB;&#x7528;&#x4E0A;&#x4E86;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#xFF1B;&#x4ECA;&#x5E74;4&#x6708;&#xFF0C;&#x5F88;&#x591A;&#x4E00;&#x3001;&#x4E8C;&#x7EBF;&#x57CE;&#x5E02;&#x7684;&#x706B;&#x8F66;&#x7AD9;&#x4E5F;&#x5F00;&#x901A;&#x4E86;&#x201C;&#x5237;&#x8138;&#x8FDB;&#x7AD9;&#x201D;&#x7684;&#x529F;&#x80FD;&#xFF1B;&#x5317;&#x4EAC;&#x7684;&#x4E00;&#x4E9B;&#x9152;&#x5E97;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x6765;&#x505A;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x3002;</p>
<p align="left">&#xA0;</p>
<p><strong>2 &#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF08;&#x8BC6;&#x522B;&#xFF09;</strong></p>
<p align="left">&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x770B;&#x51E0;&#x4E2A;&#x573A;&#x666F;&#x3002;</p>
<p align="left">&#xA0;<img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215548383-337436586.png" alt></p>
<p align="left">&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x5237;&#x8138;&#x7684;&#x81EA;&#x52A8;&#x552E;&#x8D27;&#x673A;&#x3002;&#x5F53;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6709;&#x4E2A;&#x7591;&#x95EE;&#xFF1A;&#x201D;&#x73B0;&#x5728;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x505A;&#x5230;&#x4E07;&#x65E0;&#x4E00;&#x5931;&#x4E86;&#x5417;&#xFF0C;&#x8BA4;&#x9519;&#x4EBA;&#xFF0C;&#x6263;&#x9519;&#x94B1;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x201D;&#xFF0C;&#x540E;&#x6765;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x5176;&#x5B9E;&#x5173;&#x952E;&#x4E0D;&#x5728;&#x4E8E;&#x7B97;&#x6CD5;&#xFF0C;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x7528;&#x8FC7;&#x8FD9;&#x4E2A;&#x552E;&#x8D27;&#x673A;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6C42;&#x8F93;&#x5165;&#x624B;&#x673A;&#x53F7;&#x7684;&#x540E;&#x56DB;&#x4F4D;&#xFF0C;&#x8FD9;&#x4E2A;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x81EA;&#x52A8;&#x552E;&#x8D27;&#x673A;&#x7684;&#x8BEF;&#x8BC6;&#x522B;&#x7387;&#x964D;&#x4F4E;&#x5230;&#x4EBF;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x8FD9;&#x6837;&#x5E95;&#x6982;&#x7387;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8BEF;&#x8BC6;&#x522B;&#x5E26;&#x6765;&#x7684;&#x635F;&#x5931;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x3002;&#x540C;&#x65F6;&#x8FD9;&#x6B3E;&#x81EA;&#x52A8;&#x552E;&#x8D27;&#x673A;&#x8FD8;&#x4F1A;&#x63D0;&#x9192;&#x4F60;&#xFF0C;&#x4F60;&#x7684;&#x6D88;&#x8D39;&#x884C;&#x4E3A;&#x4F1A;&#x7ED1;&#x5B9A;&#x201C;&#x829D;&#x9EBB;&#x4FE1;&#x7528;&#x201D;&#xFF0C;&#x60F3;&#x60F3;&#x6709;&#x51E0;&#x4E2A;&#x4EBA;&#x4F1A;&#x4E3A;&#x4E86;&#x4E00;&#x74F6;&#x201C;&#x53EF;&#x4E50;&#x201D;&#x53BB;&#x5F71;&#x54CD;&#x81EA;&#x5DF1;&#x7684;&#x5F81;&#x4FE1;&#x8BB0;&#x5F55;&#x5462;&#xFF1F;</p>
<p align="left">&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5237;&#x8138;&#x4E70;&#x5496;&#x5561;&#xFF0C;&#x8FDB;&#x5165;&#x5496;&#x5561;&#x5E97;&#x540E;&#xFF0C;&#x5728;&#x4F60;&#x9009;&#x597D;&#x559D;&#x4EC0;&#x4E48;&#x5496;&#x5561;&#x524D;&#xFF0C;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x8BC6;&#x522B;&#x51FA;&#x7AD9;&#x5728;&#x70B9;&#x5355;&#x53F0;&#x524D;&#x7684;&#x7528;&#x6237;&#x662F;&#x8C01;&#xFF0C;&#x5E76;&#x505A;&#x597D;&#x70B9;&#x5355;&#x51C6;&#x5907;&#xFF1B;</p>
<p align="left">&#x7B2C;&#x4E09;&#x4E2A;&#x662F;&#x5728;&#x4EBA;&#x8138;&#x95E8;&#x7981;&#x7CFB;&#x7EDF;&#x3002;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x518D;&#x5DF2;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5FD8;&#x8BB0;&#x5E26;&#x5DE5;&#x5361;&#x4E86;&#x3002;&#x4EBA;&#x8138;&#x95E8;&#x7981;&#x5BF9;&#x8BC6;&#x522B;&#x901F;&#x5EA6;&#x548C;&#x51C6;&#x786E;&#x5EA6;&#x7684;&#x8981;&#x6C42;&#x662F;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#x7684;&#xFF0C;&#x8BBE;&#x5907;&#x6302;&#x5728;&#x95E8;&#x7684;&#x4FA7;&#x9762;&#x5899;&#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x4F53;&#x9A8C;&#xFF0C;&#x589E;&#x52A0;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x96BE;&#x5EA6;&#x3002;</p>
<p align="left">&#xA0;</p>
<p><strong>3 &#x201C;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x201D;&#x8FD8;&#x662F;&#x201C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x201D;&#xFF1F;</strong></p>
<p align="left">&#x5176;&#x5B9E;&#xFF0C;&#x524D;&#x9762;&#x4E24;&#x9875;&#x7684;&#x573A;&#x666F;&#x662F;&#x6709;&#x4E9B;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x770B;&#x51FA;&#x6765;&#x4E86;&#x6CA1;&#x6709;&#x3002;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215614450-1202486677.png" alt></p>
<p align="left">&#x7B2C;&#x4E00;&#x4E2A;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x7528;&#x6237;&#x5B9E;&#x9645;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;&#x4E00;&#x662F;&#x7528;&#x6237;&#x7684;&#x8BC1;&#x4EF6;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x8EAB;&#x4EFD;&#x8BC1;&#x53F7;&#x7801;&#xFF0C;&#x6216;APP&#x8D26;&#x53F7;&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x662F;&#x7528;&#x6237;&#x7684;&#x73B0;&#x573A;&#x7167;&#x7247;&#xFF1B;&#x8FD9;&#x7C7B;&#x573A;&#x666F;&#x7684;&#x76EE;&#x6807;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#xFF1A;<strong>&#x8BA9;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x9A8C;&#x8BC1;&#x73B0;&#x573A;&#x7167;&#x7247;&#x662F;&#x5426;&#x662F;&#x8BC1;&#x4EF6;&#x6240;&#x5BA3;&#x79F0;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;</strong>&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x7C7B;&#x573A;&#x666F;<strong>&#x53EB;&#x7740;&#x201C;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x201D;</strong>&#x3002;</p>
<p align="left">&#x7B2C;&#x4E8C;&#x4E2A;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x7528;&#x6237;&#x5B9E;&#x9645;&#x53EA;&#x63D0;&#x4F9B;&#x7684;&#x73B0;&#x573A;&#x7167;&#x7247;&#xFF0C;<strong>&#x9700;&#x8981;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x5224;&#x65AD;&#x7167;&#x7247;&#x4E0A;&#x7684;&#x4EBA;&#x662F;&#x8C01;</strong>&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x7C7B;&#x573A;&#x666F;<strong>&#x53EB;&#x7740;&#x201C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x201D;</strong>&#x3002;</p>
<p align="left"><strong>&#x201C;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x201D;&#x62FF;&#x73B0;&#x573A;&#x4EBA;&#x8138;&#x8DDF;&#x7528;&#x6237;&#x6240;&#x5BA3;&#x79F0;&#x7684;&#x4EBA;&#x8138;&#x505A;1&#x6BD4;1&#x7684;&#x6BD4;&#x8F83;&#xFF0C;&#x800C;&#x201C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x201D;&#x662F;&#x62FF;&#x73B0;&#x573A;&#x4EBA;&#x8138;&#x8DDF;&#x540E;&#x53F0;&#x6CE8;&#x518C;&#x4EBA;&#x8138;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EBA;&#x8138;&#x6BD4;&#x8F83;&#xFF0C;&#x662F;1&#x6BD4;N&#x7684;&#x641C;&#x7D22;</strong>&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E24;&#x79CD;&#x573A;&#x666F;&#x7684;&#x6280;&#x672F;&#x539F;&#x7406;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x662F;&#x96BE;&#x5EA6;&#x4E0D;&#x540C;,&#x7B2C;&#x4E8C;&#x9875;&#x573A;&#x666F;&#x7684;&#x96BE;&#x5EA6;&#x666E;&#x904D;&#x6BD4;&#x7B2C;&#x4E00;&#x9875;&#x9AD8;&#x5F97;&#x591A;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>4 &#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x539F;&#x7406;</strong></p>
<p align="left">&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x600E;&#x4E48;&#x8BC6;&#x522B;&#x4EBA;&#x8138;&#x7684;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5927;&#x5BB6;&#x662F;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x600E;&#x6837;&#x6765;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF1F;</p>
<p align="left">&#x201C;&#x628A;&#x4EBA;&#x8138;&#x533A;&#x57DF;&#x4ECE;&#x56FE;&#x7247;&#x4E2D;&#x62A0;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x62FF;&#x62A0;&#x51FA;&#x6765;&#x7684;&#x4EBA;&#x8138;&#x8DDF;&#x4E8B;&#x5148;&#x6CE8;&#x518C;&#x7684;&#x4EBA;&#x8138;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x201D;&#xFF0C;&#x6CA1;&#x9519;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x8BF4;&#x8D77;&#x6765;&#x7B80;&#x5355;&#xFF0C;&#x505A;&#x53C8;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x56DE;&#x4E8B;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x53C8;&#x6709;&#x4E24;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<p align="left">&#x4E00;&#x662F;&#xFF0C;&#x201C;&#x600E;&#x6837;&#x5224;&#x65AD;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x6709;&#x6CA1;&#x6709;&#x4EBA;&#x8138;&#xFF1F;&#x201D;&#xFF0C;&#x201C;&#x600E;&#x6837;&#x77E5;&#x9053;&#x4EBA;&#x8138;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#x5462;&#x201D;&#xFF0C;&#x8FD9;&#x662F;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x56FE;&#x50CF;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x4EBA;&#x8138;&#x4EE5;&#x53CA;&#x4EBA;&#x8138;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#x5750;&#x6807;&#x3002;</p>
<p align="left">&#x4E8C;&#x662F;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x600E;&#x6837;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x4EBA;&#x8138;&#x662F;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x5462;&#xFF1F;&#x201D;&#xFF0C;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x6BD4;&#x8F83;&#x5417;&#xFF1F;&#x5149;&#x7167;&#xFF0C;&#x8868;&#x60C5;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4EBA;&#x8138;&#x504F;&#x8F6C;&#x90FD;&#x5C06;&#x5BFC;&#x81F4;&#x8BE5;&#x65B9;&#x6CD5;&#x4E0D;&#x53EF;&#x884C;&#x3002;&#x201D;&#x4EBA;&#x662F;&#x600E;&#x6837;&#x5224;&#x65AD;&#x4E24;&#x79CD;&#x7167;&#x7247;&#x4E2D;&#x7684;&#x4EBA;&#x8138;&#x662F;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5462;&#xFF1F;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#x4E24;&#x79CD;&#x7167;&#x7247;&#x4E0A;&#x7684;&#x4EBA;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x9AD8;&#x9F3B;&#x6881;&#x3001;&#x5927;&#x773C;&#x775B;&#x3001;&#x74DC;&#x5B50;&#x8138;&#x8FD9;&#x6837;&#x7684;&#x9762;&#x90E8;&#x7279;&#x5F81;&#x6765;&#x505A;&#x5224;&#x65AD;&#x7684;&#x5462;&#xFF1F;&#xA0;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215632928-1477029383.png" alt></p>
<p align="left">&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x8BA1;&#x7B97;&#x673A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x83B7;&#x53D6;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x68C0;&#x6D4B;&#x56FE;&#x50CF;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x4EBA;&#x8138;&#xFF0C;&#x4EBA;&#x8138;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x5224;&#x65AD;&#x56FE;&#x50CF;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x662F;&#x5426;&#x6A21;&#x7CCA;&#xFF0C;&#x5149;&#x7167;&#x5EA6;&#x662F;&#x5426;&#x8DB3;&#x591F;&#xFF0C;&#x7136;&#x540E;&#x68C0;&#x6D4B;&#x4EBA;&#x8138;&#x504F;&#x8F6C;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x65CB;&#x8F6C;&#x4EBA;&#x8138;&#x5230;&#x4E00;&#x4E2A;&#x6B63;&#x8138;&#x4F4D;&#x7F6E;&#xFF0C;&#x518D;&#x7136;&#x540E;&#x63D0;&#x53D6;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5BF9;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x8BC6;&#x522B;&#x7ED3;&#x679C;&#x3002;&#x5176;&#x4E2D;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x68C0;&#x6D4B;&#x548C;&#x4EBA;&#x8138;&#x5BF9;&#x9F50;&#x8FD9;&#x4E24;&#x6B65;&#x662F;&#x53EF;&#x9009;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x6839;&#x636E;&#x5177;&#x4F53;&#x5E94;&#x7528;&#x573A;&#x666F;&#x6765;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>5 &#x4EBA;&#x8138;&#x68C0;&#x6D4B;-&#x7ECF;&#x5178;&#x65B9;&#x6CD5;</strong></p>
<p align="left">&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x7ECF;&#x5178;&#x7684;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x65B9;&#x6CD5;&#x3002;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215654480-1465411731.png" alt></p>
<p align="left">OpenCV&#x548C;Dlib&#x662F;&#x4E24;&#x4E2A;&#x5E38;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x5E93;&#x3002;</p>
<p align="left">OpenCV &#x4E2D;&#x4F7F;&#x7528;Haar Cascade&#x6765;&#x505A;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#xFF0C;&#x5176;&#x5B9E;Haar Cascade&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x4EBA;&#x8138;&#x548C;&#x8138;&#x4E0A;&#x773C;&#x775B;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p align="left">DLIB&#x4E2D;&#x662F;&#x4F7F;&#x7528;&#x65B9;&#x5411;&#x68AF;&#x5EA6;&#x76F4;&#x65B9;&#x56FE;&#xFF08;Histogram of Oriented Gradient, HOG&#xFF09;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x56FE;&#x50CF;&#x5C40;&#x90E8;&#x533A;&#x57DF;&#x7684;&#x68AF;&#x5EA6;&#x65B9;&#x5411;&#x76F4;&#x65B9;&#x56FE;&#x6765;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x672C;&#x8D28;&#x5728;&#x4E8E;&#x68AF;&#x5EA6;&#x7684;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x68AF;&#x5EA6;&#x4E3B;&#x8981;&#x5B58;&#x5728;&#x4E8E;&#x8FB9;&#x7F18;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p align="left">OpenCV&#x548C;DLIB&#x5404;&#x81EA;&#x4E5F;&#x6709;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x4ECE;&#x8FD9;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x505A;&#x5230;CPU&#x5B9E;&#x65F6;&#x6216;GPU&#x5B9E;&#x65F6;&#xFF1B;<strong>&#x7ECF;&#x5178;&#x7684;&#x68C0;&#x6D4B;&#x65B9;&#x6CD5;&#x5BF9;&#x6B63;&#x8138;&#x7684;&#x68C0;&#x6D4B;&#x6548;&#x679C;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x9002;&#x5E94;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5404;&#x79CD;&#x89D2;&#x5EA6;&#x7684;&#x4EBA;&#x8138;</strong>&#x3002;</p>
<p><strong>&#xA0;</strong></p>
<p><strong>6 MTCNN&#x4EBA;&#x8138;&#x68C0;&#x6D4B;</strong></p>
<p align="left">2016&#x5E74;&#x63D0;&#x51FA;&#x6765;&#x7684;MTCNN&#x7B97;&#x6CD5;&#x662F;&#x76EE;&#x524D;&#x516C;&#x8BA4;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x662F;&#xFF08;Multi-task Cascaded Convolutional Networks&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B9E;&#x73B0;face detection&#x548C;alignment&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x548C;&#x5BF9;&#x9F50;&#x3002;</p>
<p align="left">&#x8FD9;&#x91CC;&#x7684;&#x5BF9;&#x9F50;&#x6307;&#x7684;&#x662F;&#x68C0;&#x6D4B;&#x4EBA;&#x8138;&#x773C;&#x775B;&#x3001;&#x9F3B;&#x5B50;&#x3001;&#x5634;&#x5DF4;&#x8F6E;&#x5ED3;&#x5173;&#x952E;&#x70B9;LandMark&#x3002;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215710294-1390034397.png" alt></p>
<p align="left">MTCNN&#x7B97;&#x6CD5;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x5B50;&#x7F51;&#x7EDC;&#xFF1A;<strong>P-Net &#xFF08;Proposal Network&#xFF09;&#x3001; R-Net(Refine Network)&#x3001;O-Net(Output Network)&#xFF0C;&#x8FD9;3&#x4E2A;&#x7F51;&#x7EDC;&#x6309;&#x7167;&#x7531;&#x7C97;&#x5230;&#x7EC6;&#x7684;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#x8F93;&#x5165;&#x7167;&#x7247;&#xFF0C;&#x6BCF;&#x4E2A;&#x7F51;&#x7EDC;&#x6709;3&#x6761;&#x652F;&#x8DEF;&#x7528;&#x6765;&#x5206;&#x522B;&#x505A;&#x4EBA;&#x8138;&#x5206;&#x7C7B;&#x3001;&#x4EBA;&#x8138;&#x6846;&#x7684;&#x56DE;&#x5F52;&#x548C;&#x4EBA;&#x8138;&#x5173;&#x952E;&#x70B9;&#x5B9A;&#x4F4D;</strong>&#x3002;</p>
<p align="left">&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;<strong>&#x6700;&#x5F00;&#x59CB;&#x5BF9;&#x5728;&#x591A;&#x4E2A;&#x5C3A;&#x5EA6;&#x4E0A;&#x5BF9;&#x56FE;&#x50CF;&#x505A;&#x4E86;resize&#xFF0C;&#x6784;&#x6210;&#x4E86;&#x56FE;&#x50CF;&#x91D1;&#x5B57;&#x5854;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x5C3A;&#x5EA6;&#x7684;&#x56FE;&#x50CF;&#x4F5C;&#x4E3A;P&#x3001;P&#x3001;O&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x4E0D;&#x540C;&#x5C3A;&#x5EA6;&#x7684;&#x4EBA;&#x8138;</strong>&#x3002;</p>
<p align="left"><strong>P-Net&#x4E3B;&#x8981;&#x7528;&#x6765;&#x751F;&#x6210;&#x5019;&#x9009;&#x4EBA;&#x8138;&#x6846;&#x3002; R-Net&#x4E3B;&#x8981;&#x7528;&#x6765;&#x53BB;&#x9664;&#x5927;&#x91CF;&#x7684;&#x975E;&#x4EBA;&#x8138;&#x6846;&#x3002;O-Net&#x548C;R-Net&#x6709;&#x70B9;&#x50CF;&#xFF0C;&#x5728;R-NET&#x57FA;&#x7840;&#x4E0A;&#x589E;&#x52A0;&#x4E86;landmark&#x4F4D;&#x7F6E;&#x7684;&#x56DE;&#x5F52;&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4EBA;&#x8138;&#x6846;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x548C;&#x5173;&#x952E;&#x70B9;&#x4FE1;&#x606F;</strong>&#x3002;</p>
<p>&#xA0;</p>
<p><strong>7 &#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;-&#x7ECF;&#x5178;&#x65B9;&#x6CD5;</strong></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x3002;&#x7ECF;&#x5178;&#x7684;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x65B9;&#x6CD5;&#x6709;EigenFace&#x548C;FisherFace&#x4E24;&#x79CD;&#x3002;</p>
<p><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215735415-658215758.png" alt></p>
<p align="left">EigenFace&#x7684;&#x601D;&#x60F3;&#x662F;&#x628A;&#x4EBA;&#x8138;&#x4ECE;&#x50CF;&#x7D20;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#x4E2D;&#x505A;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x8BA1;&#x7B97;&#x3002;EigenFace&#x7684;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x65B9;&#x6CD5;&#x662F;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;PCA&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;90&#x5E74;&#x4EE3;&#x5F00;&#x59CB;&#x5E94;&#x7528;&#x4E8E;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3B;&#x6210;&#x5206;&#x6709;&#x4EBA;&#x8138;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;&#x7279;&#x5F81;&#x8138;&#x201D;&#x3002;</p>
<p align="left">FisherFace&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x7EBF;&#x6027;&#x5224;&#x522B;&#x5206;&#x6790;LDA(&#x5168;&#x79F0;Linear &#xA0;Discriminant Analysis,)&#x7684;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7B97;&#x6CD5;&#xFF0C; LDA&#x548C;PCA&#x90FD;&#x662F;&#x5229;&#x7528;&#x7279;&#x5F81;&#x503C;&#x6392;&#x5E8F;&#x627E;&#x5230;&#x4E3B;&#x5143;&#x7684;&#x8FC7;&#x7A0B;&#x3002;LDA&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x4E0D;&#x540C;&#x4EBA;&#x8138;&#x7684;&#x5DEE;&#x5F02;&#x800C;&#x4E0D;&#x662F;&#x7167;&#x660E;&#x6761;&#x4EF6;&#x3001;&#x4EBA;&#x8138;&#x8868;&#x60C5;&#x548C;&#x65B9;&#x5411;&#x7684;&#x53D8;&#x5316;&#x3002;&#x6240;&#x4EE5;&#xFF0C;Fisherface&#x5BF9;&#x4EBA;&#x8138;&#x5149;&#x7167;&#x3001;&#x4EBA;&#x8138;&#x59FF;&#x6001;&#x53D8;&#x5316;&#x7684;&#x5F71;&#x54CD;&#x66F4;&#x4E0D;&#x654F;&#x611F;&#x3002;</p>
<p align="left">&#xA0;</p>
<p><strong>8 &#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;-&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6CD5;</strong></p>
<p align="left">&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x770B;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6CD5;&#x3002;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215752647-378408804.png" alt></p>
<p align="left"><strong>&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x9AD8;&#x5EA6;&#x62BD;&#x8C61;&#x7684;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7279;&#x5F81;&#x8868;&#x793A;&#x4E3A;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x6B27;&#x5F0F;&#x8DDD;&#x79BB;&#x6765;&#x5224;&#x5B9A;&#x4E24;&#x5F20;&#x7167;&#x7247;&#x662F;&#x5426;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;</strong>&#x3002;</p>
<p align="left">&#xA0;</p>
<p><strong>9&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;-&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6CD5;</strong></p>
<p><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215808448-1267277718.png" alt></p>
<p align="left">&#x603B;&#x4F53;&#x601D;&#x8DEF;&#x662F;&#x628A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4EBA;&#x7269;&#x5F53;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;<strong>&#x901A;&#x8FC7;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x65BD;&#x52A0;&#x7EA6;&#x675F;&#xFF0C;&#x8BA9;&#x76F8;&#x540C;&#x7684;&#x4EBA;&#x7684;&#x7167;&#x7247;&#x63D0;&#x53D6;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FD1;&#xFF0C;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7167;&#x7247;&#x7684;&#x63D0;&#x53D6;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8FDC;</strong>&#x3002;</p>
<p align="left">&#x7B2C;&#x4E00;&#x4E2A;Logit&#x7684;&#x5730;&#x65B9;&#x8F93;&#x51FA;&#x7684;&#x662F;&#x4EBA;&#x8138;&#x7684;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x4E00;&#x822C;&#x662F;128&#x7EF4;&#x6216;&#x8005;512&#x7EF4;&#xFF0C;&#x6D6E;&#x70B9;&#x5411;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;Logit&#x524D;&#x9762;&#x662F;CNN&#x5206;&#x7C7B;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x4E2A;Logit&#x540E;&#x9762;&#x7684;&#x90E8;&#x5206;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x65BD;&#x52A0;&#x7EA6;&#x675F;&#x6765;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x8BA9;&#x6A21;&#x578B;&#x533A;&#x5206;&#x76F8;&#x540C;&#x7684;&#x4EBA;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x90E8;&#x5206;&#x53EA;&#x9700;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x9636;&#x6BB5;&#x8BA1;&#x7B97;&#xFF0C;&#x63A8;&#x7406;&#x9636;&#x6BB5;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>10 &#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;-Metric Learning</strong></p>
<p>&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x65B9;&#x6CD5;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x7C7B;&#xFF0C;&#x4E00;&#x7C7B;Metric Learning&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;Additive Margin&#xFF0C;&#x8FD9;&#x4E24;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x201C;<strong>&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#xFF0C;&#x8BA9;&#x76F8;&#x540C;&#x4EBA;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FD1;&#xFF0C;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8FDC;</strong>&#x201D;&#x3002;</p>
<p><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215824404-1242980278.png" alt></p>
<p align="left">&#x5B6A;&#x751F;&#x7F51;&#x7EDC;&#x548C;Triplet&#x90FD;&#x5C5E;&#x4E8E; Metric Learning&#x8FD9;&#x7C7B;&#x65B9;&#x6CD5;&#x3002;&#x5DE6;&#x8FB9;&#x5B6A;&#x751F;&#x7F51;&#x7EDC;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x6709;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x8BA9;&#x76F8;&#x540C;&#x7684;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8FD1;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8BA9;&#x4E0D;&#x540C;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FDC;&#x3002;</p>
<p align="left">&#x53F3;&#x8FB9;Triplet&#x7F51;&#x7EDC;&#x662F;&#x5BF9;&#x5B6A;&#x751F;&#x7F51;&#x7EDC;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x5C06;&#x6837;&#x672C;&#x7EC4;&#x7EC7;&#x4E3A;&#x951A;&#x70B9;&#x3001;&#x6B63;&#x6837;&#x672C;&#x3001;&#x8D1F;&#x6837;&#x672C;&#x7684;&#x5143;&#x7EC4;&#xFF0C;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x8BA9;&#x951A;&#x70B9;&#x4E0E;&#x6B63;&#x6837;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8FD1;&#xFF0C;&#x951A;&#x70B9;&#x4E0E;&#x8D1F;&#x6837;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8FDC;&#xFF0C;&#x5E76;&#x4E14;&#x81F3;&#x5C11;&#x8FDC;&#x4E8E;&#x4E00;&#x4E2A;&#x9600;&#x503C;&#x963F;&#x5C14;&#x6CD5;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>11 &#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;-Additive Margin</strong></p>
<p align="left">Additive Margin&#x8FD9;&#x7C7B;&#x65B9;&#x6CD5;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5206;&#x7C7B;&#x6A21;&#x578B;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6765;&#x8FBE;&#x5230;&#x201C;&#x8BA9;&#x76F8;&#x540C;&#x4EBA;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FD1;&#xFF0C;&#x8BA9;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FDC;&#x201D;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p align="left">&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;<strong>Metric Learning&#x7684;&#x65B9;&#x6CD5;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF1A;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x6837;&#x672C;&#xFF0C;&#x6A21;&#x578B;&#x6700;&#x7EC8;&#x80FD;&#x5426;&#x6536;&#x655B;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x91C7;&#x6837;&#x662F;&#x4E0D;&#x662F;&#x5408;&#x7406;</strong>&#x3002;&#x57FA;&#x4E8E;Additive Margin&#x7684;&#x65B9;&#x6CD5;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x5B8C;&#x5168;&#x5C06;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x5F53;&#x505A;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;&#x53C2;&#x6570;&#x7684;&#x8BBE;&#x7F6E;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x591A;trick&#xFF0C;Additive Margin&#x7684;&#x65B9;&#x6CD5;&#x5927;&#x90FD;&#x662F;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x505A;&#x6587;&#x7AE0;&#x3002;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215841704-314649006.png" alt></p>
<p align="left">&#x6700;&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x65B9;&#x6CD5;&#x7814;&#x7A76;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x56FE;&#x4E2D;&#x7684;softmax&#xFF0C;Sphereface&#xFF0C;Cosface&#xFF0C;ArcFace&#x90FD;&#x662F;Additive Margin&#x65B9;&#x6CD5;&#xFF0C;<strong>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5B83;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x6539;&#x8FDB;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x201C;&#x8BA9;&#x76F8;&#x540C;&#x4EBA;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FD1;&#xFF0C;&#x8BA9;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x7279;&#x5F81;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x8FDC;&#x201D;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;</strong>&#x3002;</p>
<p align="left">&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x56FE;&#x4E2D;&#xFF0C;&#x989C;&#x8272;&#x76F8;&#x540C;&#x7684;&#x70B9;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x70B9;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x7684;&#x5C55;&#x793A;&#x6BD4;&#x8F83;&#x5F62;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;<strong>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8D85;&#x7403;&#x4F53;&#x7684;&#x6548;&#x679C;&#x975E;&#x5E38;&#x4E0D;&#x9519;</strong>&#x3002;</p>
<p align="left">Additive Margin&#x6B63;&#x5728;&#x6210;&#x4E3A;&#x4E3B;&#x6D41;&#xFF0C; InsightFace&#x4E5F;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E00;&#x7C7B;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6B63;&#x662F;&#x8FD9;&#x4E2A;ArcFace&#x3002;</p>
<p align="left">&#x5927;&#x5BB6;&#x53EF;&#x7528;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5206;&#x7C7B;&#x65B9;&#x6CD5;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x7528;&#x4E8E;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1F;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x4E86;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>12 &#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;-&#x6548;&#x679C;&#x8BC4;&#x4F30;</strong></p>
<p align="left">&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x600E;&#x6837;&#x8BC4;&#x4F30;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p align="left"><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215857983-298838064.png" alt></p>
<p align="left">&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x53EC;&#x56DE;&#x7387;&#x548C;&#x865A;&#x8B66;&#x7387;&#x4E24;&#x4E2A;&#x6307;&#x6807;&#x6765;&#x8861;&#x91CF;&#x3002;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E24;&#x4E2A;&#x6307;&#x6807;&#x7684;&#x8BBE;&#x7F6E;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<strong>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6211;&#x4EEC;&#x90FD;&#x8981;&#x6C42;&#x5728;&#x865A;&#x8B66;&#x7387;&#x5C0F;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#xFF08;&#x6BD4;&#x5982;&#x4E07;&#x5206;&#x4E4B;&#x4E00;&#xFF09;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x53EC;&#x56DE;&#x7387;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x503C;&#xFF08;&#x6BD4;&#x5982;99%&#xFF09;</strong>&#x3002;&#x5F88;&#x591A;&#x4EA7;&#x54C1;&#x5BA3;&#x79F0;&#x7684;&#x8BC6;&#x522B;&#x51C6;&#x786E;&#x7387;&#x8FBE;&#x5230;&#x591A;&#x5C11;&#x591A;&#x5C11;&#xFF0C;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x516C;&#x5F00;&#x6570;&#x636E;&#x96C6;&#x6BD4;&#x5982;LFW&#x4E0A;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x516C;&#x5F00;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x6BD4;&#x8F83;&#x63A8;&#x8350;&#x7684;&#x6709;&#xFF1A;<strong>MS1MV2&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5FAE;&#x8F6F;&#x524D;&#x6BB5;&#x4E8B;&#x4EF6;&#x5DF2;&#x7ECF;&#x5BA3;&#x5E03;&#x64A4;&#x56DE;&#x4E0D;&#x518D;&#x63D0;&#x4F9B;&#x4E0B;&#x8F7D;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5927;&#x6982;&#x6709;85000&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x7684;380&#x4E07;&#x5F20;&#x7167;&#x7247;</strong>&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x662F;GLINT_ASIA&#xFF0C;&#x6709;9&#x4E07;&#x591A;&#x4EBA;&#x7684;280&#x4E07;&#x5F20;&#x7167;&#x7247;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>13 &#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x7684;&#x6311;&#x6218;&#x53CA;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;</strong></p>
<p align="left">&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x8BA4;&#x4E3A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#xFF0C;&#x7B97;&#x6CD5;&#x5305;&#x6253;&#x5929;&#x4E0B;&#xFF0C;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x6700;&#x597D;&#x7684;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x4E5F;&#x625B;&#x4E0D;&#x4F4F;&#x50CF;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x5DEE;&#x3002;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x5DEE;&#x3001;&#x59FF;&#x52BF;&#x53D8;&#x5316;&#x3001;&#x9762;&#x90E8;&#x5F62;&#x72B6;/&#x7EB9;&#x7406;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#x7684;&#x53D8;&#x5316;&#x3001;&#x906E;&#x6321;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E2D;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p align="left">&#x5F53;&#x7136;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x95EE;&#x9898;&#x5DE5;&#x7A0B;&#x4E0A;&#x6211;&#x4EEC;&#x6709;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x6A21;&#x7CCA;&#xFF0C;&#x5149;&#x7167;&#x4E0D;&#x8DB3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5148;&#x68C0;&#x6D4B;&#x56FE;&#x50CF;&#x662F;&#x5426;&#x6A21;&#x7CCA;&#xFF0C;&#x5173;&#x7167;&#x662F;&#x5426;&#x4E0D;&#x8DB3;&#xFF0C;&#x8D28;&#x91CF;&#x4E0D;&#x8FC7;&#x5173;&#xFF0C;&#x5C31;&#x4E0D;&#x628A;&#x56FE;&#x50CF;&#x9001;&#x7ED9;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x3002;</p>
<p align="left">&#x518D;&#x6BD4;&#x5982;&#xFF0C;&#x7528;&#x4ED6;&#x4EBA;&#x7167;&#x7247;&#x6216;&#x89C6;&#x9891;&#x6765;&#x6B3A;&#x9A97;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x6709;&#x591A;&#x79CD;&#x6D3B;&#x4F53;&#x68C0;&#x6D4B;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x6D4B;&#x5E76;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="https://img2018.cnblogs.com/blog/78343/201911/78343-20191123215914804-1602659887.png" alt></p>
<p align="left">&#x7ECF;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5728;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x9886;&#x57DF;&#x7684;&#x6478;&#x722C;&#x6EDA;&#x6253;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;<strong>&#x5F71;&#x54CD;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#x662F;&#x8BC6;&#x522B;&#x5FEB;&#x3001;&#x8BC6;&#x522B;&#x51C6;&#xFF0C;&#x8BC6;&#x522B;&#x5FEB;&#x4E3B;&#x8981;&#x9760;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BC6;&#x522B;&#x51C6;&#x4E3B;&#x8981;&#x9760;&#x7B97;&#x6CD5;</strong>&#x3002;</p>
<p align="left">&#x62FF;&#x4EBA;&#x8138;&#x95E8;&#x7981;&#x6765;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x4E0A;&#x53EF;&#x4EE5;&#x5728;&#x524D;&#x7AEF;&#x91C7;&#x96C6;&#x7167;&#x7247;&#x7684;&#x65F6;&#x5019;&#x8FC7;&#x6EE4;&#x6389;&#x6A21;&#x7CCA;&#x3001;&#x65E0;&#x4EBA;&#x8138;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x907F;&#x514D;&#x65E0;&#x6548;&#x8BC6;&#x522B;&#xFF0C;&#x540C;&#x65F6;&#x524D;&#x7AEF;&#x5728;&#x91C7;&#x96C6;&#x7167;&#x7247;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x91C7;&#x96C6;&#x591A;&#x5F20;&#x5E76;&#x53D1;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#xFF0C;&#x505A;&#x5E76;&#x53D1;&#x8BC6;&#x522B;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x63D0;&#x5347;&#x8BC6;&#x522B;&#x901A;&#x8FC7;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
</body>
</html>